#include <iostream>
using namespace std;
int dp[101];

int main()
{
	int T;
	cin >> T;
	dp[1] = dp[2] = dp[3] = 1;
	dp[4] = 2;
	
	for (int i = 5; i <= T; i++)
	{
		if (dp[i] + dp[i + 1] == dp[i + 3])
		{
			dp[i]++;
		}
		else
		{
			dp[i] = 1;
		}

		cout << (dp[T] == 0 ? 0 : dp[T]) << endl;
		return 0;
	}

	return 0;
}

// 첫번째 숫자 + 두번째 숫자 = 네번째 숫자
// 1 1 1 2 -> 1 + 1 = 2 / 1 ~ 4 / 1 2 4
// 1 1 2 2 -> 1 + 1 = 2 / 2 ~ 5 / 2 3 5
// 1 2 2 3 -> 1 + 2 = 3 / 3 ~ 6 / 3 4 6
// 2 2 3 4 -> 2 + 2 = 4 / 4 ~ 7 / 4 5 7
// 2 3 4 5 -> 2 + 3 = 5 / 5 ~ 8 / 5 6 8
// 3 4 5 7 -> 3 + 4 = 7 / 6 ~ 9 / 6 7 9
// 4 5 7 9 -> 4 + 5 = 9 / 7 ~ 10 / 7 8 10
//  
// 1 1 1 2 2 3 4 5 7 9
// 계속 생성될 때 첫번째 숫자와 두번째 숫자를 더했을 때 
// 네번째 숫자를 더했을 때 처음 생성됐던 숫자보다 크면 계속 생성